#  todo: Дан номер месяца (1 — январь, 2 — февраль, ...). Вывести название соответствующего
#  времени года ("зима", "весна" и т.д.).

dictionary = (
    'январь',
    'февраль',
    'март',
    'апрель',
    'май',
    'июнь',
    'июль',
    'август',
    'сентябрь',
    'октябрь',
    'ноябрь',
    'декабрь',
)

idx = int(input("Введите целое число -- номер месяца (1...12): "))

if idx > (len(dictionary)) or idx < 1:
    print('Введённое число не входит в допустимый диапазон')
    exit(1)

print(f"Под номером {idx} находится месяц {dictionary[idx - 1]}")
