# todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

x = float(input("Введите первое число: "))
y = float(input("Введите второе число: "))
print(f"Сумма: {x + y}")
print(f"Разность: {x - y}")
print(f"Частное: {x / y}")
print(f"Произведение: {x * y}")
print(f"Целочисленное деление: {x // y}")
print(f"Остаток деления: {x % y}")
print(f"Степень: {x ** y}")
