# todo: 10.1 Дано целое число A. Проверить истинность высказывания: «Число A является четным».
# todo: 10.2 Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».
# Примечание: В задании  требуется вывести логическое значение True, если выражение
# для введеных исходных данных является истинным, и значение False в противном случае.

A = int(input("Введите целое число A: "))

is_even = not (A % 2)
is_odd = not is_even

print(f"{'Да' if is_even else 'Нет'}. Число{' не' if not is_even else ''} является чётным")
print(f"{'Да' if is_odd else 'Нет'}. Число{' не' if not is_odd else ''} является нечётным")
