# todo: Единицы массы пронумерованы следующим образом: 1 — килограмм, 2 — миллиграмм, 3 — грамм,
#  4 — тонна, 5 — центнер. Дан номер единицы массы и масса тела M в этих единицах (вещественное число).
#  Вывести массу данного тела в килограммах

dictionary = (
    ('килограмм', 1),
    ('миллиграмм', 1e-6),
    ('грамм', 1e-3),
    ('тонна', 1000),
    ('центнер', 100),
)

idx = int(input("""
    Введите целое число -- номер единицы измерения:
        1 — килограмм,
        2 — миллиграмм,
        3 — грамм,
        4 — тонна,
        5 — центнер:"""))

if idx > (len(dictionary)) or idx < 1:
    print('Введённое число не входит в допустимый диапазон')
    exit(1)

entry = dictionary[idx-1]
name = entry[0]
coef = entry[1]

mass = float(input(f"Введите значение массы в выбранных единицах измерения ({name}):"))

result = coef * mass

print(f"Масса в выбранных единицах ({name}) равна {result}")
