# В восточном календаре принят 60-летний цикл, состоящий из 12- летних подциклов,
# обозначаемых названиями цвета: зеленый, красный, желтый, белый и черный.
# В каждом подцикле годы носят названия животных: крысы, коровы, тигра, зайца, дракона,
# змеи, лошади, овцы, обезьяны, курицы, собаки и свиньи. По номеру года вывести его название,
# если 1984 год был началом цикла — годом зеленой крысы.

large_cycle = ('зеленый', 'красный', 'желтый', 'белый', 'черный')
small_cycle = (
    'крысы',
    'коровы',
    'тигра',
    'зайца',
    'дракона',
    'змеи',
    'лошади',
    'овцы',
    'обезьяны',
    'курицы',
    'собаки',
    'свиньи'
)
zero_year = 1984

year = int(input("Введите целое число - год по григорианскому календарю:"))

diff = year - zero_year

large_idx = diff // len(small_cycle)
large_word = large_cycle[large_idx]

small_idx = diff % len(small_cycle)
small_word = small_cycle[small_idx]


print(f"Год {year} - это {large_word} год {small_word}")
